### Series : 일련의 객체를 담는 1차원 배열

### ```pd.Series(values, index)``` : Series 생성
### ```.values``` : Series의 값
### ```.index``` : Series의 인덱스

In [39]:
import pandas as pd
import numpy as np

In [30]:
obj = pd.Series([4, 7, -5, 3], index = ['d', 'b', 'a', 'c'])
obj

d    4
b    7
a   -5
c    3
dtype: int64

In [31]:
print(obj.values)
print(obj.index)

[ 4  7 -5  3]
Index(['d', 'b', 'a', 'c'], dtype='object')

#### 인덱스

In [35]:
print(obj['a'])

-5

In [36]:
obj['d'] = 6
obj[['a', 'c', 'b', 'd']]

a   -5
c    3
b    7
d    6
dtype: int64

- 조건문 인덱스

In [42]:
obj[obj > 0]

d    6
b    7
c    3
dtype: int64

#### 연산

In [116]:
obj * 2
np.exp(obj)
print(obj3 + obj4) # 자동 join

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [72]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
obj

Bob      6
Steve    7
Jeff    -5
Ryan     3
dtype: int64

#### Series는 고정 길의의 정렬된 사전형
- Series는 색인값에 데이터값을 매핑하고 있음

In [48]:
print('b' in obj)
print('e' in obj)

True
False

- 딕셔너리를 Series로 변환

In [54]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = pd.Series(sdata)

In [55]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = pd.Series(sdata, index = states)
print(obj4)

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

### ```pd.isnull()```, ```.isnull()``` : 결측값 여부 확인
### ```pd.notnull()```, ```is.notnull()``` : 결측값 아닌지 여부 확인

In [64]:
print(np.sum(obj4.isnull()))
print(np.sum(pd.isnull(obj4)))

1
1

#### Series의 인덱스는 모두 name 속성이 존재 (**열 이름**)
### ```.name```, ```.index.name```

In [71]:
obj4.name = 'population' # 열이름
obj4.index.name = 'state'
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

### 
### DataFrame
### ```pd.DataFrame(data, columns, index)``` : 데이터 프레임 생성
### ```.columns``` : 데이터 프레임 열
### ```.index``` : 데이터 프레임 인덱스

#### 
### ```.head()``` : 상위 6개 값

In [86]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)
frame.head

<bound method NDFrame.head of     state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2>

In [91]:
print(frame.columns)
print(frame.index)

Index(['state', 'year', 'pop'], dtype='object')
RangeIndex(start=0, stop=6, step=1)

- Series와 마찬가지로 딕셔너리에 없는 값을 넘기면 결측치로 저장

In [89]:
frame2 = pd.DataFrame(data, columns = ['year', 'state', 'pop', 'debt'],
                      index = ['one', 'two', 'three', 'four',
                             'five', 'six'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

#### 인덱스 : Series처럼 사전 형식의 표기법 혹은 속성 형식으로 접근 가능

In [ ]:
frame2['state'] # frame2의 'state'열 (= frame2.year)
frame2.loc['three'] # frame2의 인덱스가'three'인 행

- 인덱스를 통한 값 대입

In [113]:
frame2['debt'] = np.arange(6.)

- 리스트나 배열을 열에 대입할 때, 대입하려는 값의 길이가 데이터 프레임의 크기와 동일해야 한다.
- Series를 대입하면 DataFrame의 인덱스에 따라 값이 대입, 존재하지 않는 인덱스에는 결측치가 대입

In [108]:
val = pd.Series([-1.2, -1.5, -1.7], index = ['two', 'four', 'five'])
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

- 존재하지 않는 열을 대입하면 새로운 열을 생성

In [111]:
frame2['eastern'] = frame2.state == 'Ohio'

#### ```del``` 에약어를 통한 열 삭제

In [117]:
del frame2['eastern']
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

#### 중첩된 딕셔너리를 통한 데이터 생성

In [120]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

### ```.T``` : 전치행렬

In [121]:
frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

#### 데이터 프레임의 인덱스와 열에 name을 지정

In [124]:
frame3.index.name = 'year'; frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

### 데이터 프레임 생성을 위한 입력 데이터 종류
| 형 | 설명 |
| -- | -- |
| 2차원 ndarray | 데이터를 담고 있는 행렬, 선택적으로 행과 열의 이름을 전달 가능 |
| 배열, 리스트, 튜플의 딕셔너리 | 사전의 모든 항목은 같은 길이를 가져야 하며, 각 항목의 데이터 프레임의 열이 된다 |
| NumPy의 구조화 배열 | 배열의 ㅅ자ㅓㄴ과 같은 방식으로 취급 |
| Series의 딕셔너리 | Series의 각 값이 컬럼이 된다. 명시적으로 인덱스를 넘겨주지 않으면 각 Series의 인덱스가 하나로 합쳐져서 행의 색인이 된다 |
| 딕셔너리의 딕셔너리 | 내부에 있는 딕셔너리의 열이 된다. 키값은 'Series의 딕셔너리'과 마찬가지로 합쳐져서 행의 인덱스가 된다 |
| 딕셔너리나 Series의 리스트 | 리스트의 각 항목이 데이터 프레임의 행이 된다. 합쳐진 사전의 키값이나 Series의 인덱스가 데이터 프레임의 열 이름이 된다. |
| 리스트나 튜플의 리스트 | '2차원 ndarray'의 경우와 같은 방식 |
| 다른 데이터 프레임 | 인덱스가 따로 지정하지 않으면 데이터 프레임의 인덱스가 그대로 사용 |
| NumPy MaskedArray | '2차원 ndarray'의 경우와 같은 방식으로 취급되지만 마스크값은 반환되는 데이터프레임에서 NA 값이 된다. |

### 
### 인덱스 객체

In [130]:
obj = pd.Series(range(3), index = ['a', 'b', 'c'])
index = obj.index
print(index)
print(index[1:])

Index(['a', 'b', 'c'], dtype='object')
Index(['b', 'c'], dtype='object')

#### - 인덱스 객체는 변경이 불가능

In [ ]:
index[1] = 'd' # TypeError

- 자료구조 사이에서 공유 가능

In [134]:
labels = pd.Index(np.arange(3))
labels

Int64Index([0, 1, 2], dtype='int64')

In [135]:
obj2 = pd.Series([1.5, -2.5, 0], index = labels)
obj2.index is labels

True

- 인덱스 객체도 고정 크기로 동작

In [141]:
print(frame3.columns)
print(frame3)

Index(['Nevada', 'Ohio'], dtype='object', name='state')
state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [138]:
'Ohio' in frame3.columns

True

In [139]:
2003 in frame3.index

False

- pandas는 인덱스의 중복되는 값 허용, 중복되는 값으로 선택 시 해당 값을 가진 모든 항목이 선택

In [142]:
dup_labels = pd.Index(['foo', 'foo', 'bar', 'bar'])
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

#### 인덱스의 메서드와 속성

| 메서드 | 설명 |
| -- | -- |
| .append | 추가적인 인덱스 객체를 덧붙여 새로운 인덱스 반환 |
| .difference | 인덱스의 차집합 |
| .intersection | 인덱스의 교집합 |
| .union | 인덱스의 합집합 |
| .isin | 인덱스가 넘겨받은 인덱스에 존재하는지 알려주는 boolean 배열 반환 |
| .delete | i 위치에 인덱스가 삭제된 새로운 인덱스 반환 |
| .drop | 넘겨받은 값이 삭제된 새로운 인덱스 반환 |
| .insert | i 위치에 인덱스가 추가된 새로운 인덱스 반환 |
| .is_monotonic | 인덱스가 단조성을 가진다면 True |
| .isunique | 중복되는 인덱스가 없다면 True 반환 |
| .unique | 인덱스에서 중복되는 요소를 제거하고 유일한 값만 반환 |

### 
### 핵심 기능

### reindex (재색인) 
### ```.reindex(index, ... )``` : 데이터를 새로운 인덱스에 맞게 재배열, 존재하지 않는 인덱스가 잇다면 NaN을 추가

- .reindex 함수의 인자

| 인자 | 설명 |
| -- | -- |
| index | 인덱스로 사용할 새로운 순서, Index 인스턴스나 다른 순차적인 자료구조가 사용 가능, Index는 복사가 이루어지지 않고 그대로 사용됨 |
| method | 채움 메서드, 'ffill'은 직전 값을 채워 넣고, 'bfill'은 다음 값을 채워 넣음 |
| fill_value | reindex 과정 중에 새롭게 나타나는 비어있는 데이터를 채우기 위한 값 |
| limit | 전/후 보간 시에 사용할 최대 갭 크기 (채워 넣을 원소의 수) |
| tolerance | 전/후 보간 시에 사용할 최대 갭 크기 (값의 차이) |
| level | Multiindex의 단계(level)에 단순 인덱스를 맞춤. 그렇지 않으면 Multiindex의 하위집합에 맞춤 |
| copy | True인 경우 새로운 인덱스가 이전 인덱스와 동일하더라도 데이터를 복사. False인 경우 새로운 색인이 이전 색인과 동일할 경우 복사하지 않음 |

In [145]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

- 시계열 같은 순차적인 데이터를 reindex할 때 값을 보관하거나 채워 넣어야 할 경우가 존재 => ```method = 'ffill'```등 의 메서드를 이용하여 누락된 값을 직전의 값으로 채워 넣음

In [150]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index = [0, 2, 4])
obj3.reindex(range(6) , method = 'ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

- reindex는 행, 열 둘 다 변경 가능

In [153]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                     index=['a', 'c', 'd'],
                     columns=['Ohio', 'Texas', 'California'])

In [152]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

- 열이름reindex

In [155]:
states = ['Texas', 'Utah', 'California']
frame.reindex(columns = states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

### 
### 행, 열 삭졔
### ```.drop(index, axis)``` : 선택한 값들이 삭제된 새로운 객체
- ```axis``` : 0 혹은 'index'면 행, 1 혹은 'columns'면 열

In [169]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
obj.shape

(5,)

In [170]:
new_obj = obj.drop('c')
new_obj.shape

(4,)

- drop 함수에 인자로 행 이름을 넘기면 해당 행의 값을 모두 삭제

In [177]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index =['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns =['one', 'two', 'three', 'four'])
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

- 열의 값을 삭제할 대 axis = 1 도는 axis = 'columns'

In [181]:
data.shape

(4, 4)

In [180]:
data.drop('two', axis = 1).shape

(4, 3)

- **inplace 인자 사용시 버려지는 값을 모두 삭제**, (원본 객체 변경)

In [ ]:
obj.drop('c', inplace = True)

###
### 인덱싱, 슬라이싱, 필터링

#### 데이터 프레임의 값 선택

| 방식 | 설명 |
| -- | -- |
| df[val] | 데이터 프레임에서 하나의 열 또는 여러 열을 선택. 편의를 위해 boolean 배열, 슬라이스 배열, boolean 데이터 프레임을 사용 가능 |
| df.loc[val] | 데이터프레임에서 라벨값으로 행의 부분집합 선택 |
| df.loc[:, val] | 데이터프레임에서 라벨값으로 열의 부분집합 선택 |
| df.loc[val1, val2] | 데이터프레임에서 라벨값으로 행과 열의 부분집합 선택 |
| df.iloc[where] | 데이터프레임에서 정수 인덱스로 행의 부분집합 선택 |
| df.iloc[:, where] | 데이터프레임에서 정수 인덱스로 열의 부분집합 선택 |
| df.iloc[where_i, where_j] | 데이터프레임에서 정수 인덱스로 행과 열의 부분집합 선택 |
| df.at[label_i, label_j] | 행과 열의 라벨로 단일 값을 선택 |
| df.iat[i, j] | 행과 열의 정수 인덱스로 단일 값을 선택 |
| reindex 메서드 | 하나 이상의 축을 새롱 인덱스로 맞춘다 |
| get_value, set_value 메서드 | 행과 열 이름으로 데이터 프레임 값을 선택 |

In [185]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

#### - 라벨 이름으로 슬라이싱 하면 시작점과 끝점을 포함

In [190]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [191]:
obj['b':'c'] = 5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

- 인덱스로 데이터 프레임에서 하나 이상의 열 값을 가져올 수 있다
- 슬라이싱으로 행을 선택하거나, boolean 배열로 행을 선택 가능

### loc, iloc
### loc : 축 이름으로 선택시 / iloc : 정수 인덱스로 선택시

In [197]:
data.loc['Colorado', ['two', 'three']] # Colorado행의 'two', 'three'열

two      5
three    6
Name: Colorado, dtype: int32

In [200]:
data.iloc[[1, 2], [3, 0, 1]] # 1행, 2행의 4열, 1열, 2열

          four  one  two
Colorado     7    4    5
Utah        11    8    9

- 슬라이싱, 단일 라벨, 라벨 리스트

In [202]:
data.loc[:'Utah', 'two']

Ohio        1
Colorado    5
Utah        9
Name: two, dtype: int32

In [201]:
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    4    5      6
Utah        8    9     10
New York   12   13     14

### 정수 인덱스

In [205]:
ser = pd.Series(np.arange(3.))
ser2 = pd.Series(np.arange(3.), index = ['a', 'b', 'c'])
ser2[-1]

2.0

In [212]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [207]:
ser[:1]

0    0.0
dtype: float64

In [208]:
ser.loc[:1]

0    0.0
1    1.0
dtype: float64

In [209]:
ser.iloc[:1]

0    0.0
dtype: float64

### 산술 연산과 데이터 정렬

- 차원이 다른 Series의 연산시, outer join

In [216]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index = ['a', 'c', 'd', 'e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],
               index = ['a', 'c', 'e', 'f', 'g'])
s1 + s2 # outer join

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

- 겹치는 인덱스가 없는 경우 데이터는 NA

In [217]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
                   index=['Ohio', 'Texas', 'Colorado'])
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                   index=['Utah', 'Ohio', 'Texas', 'Oregon'])
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

### 산술 연산 메서드에 채울 값 지정

#### 산술 연산 메서드

| 메서드 | 설명 |
| -- | -- |
| .add, .radd | 덧셈 |
| .sub, .rsub |  뺄셈 |
| .div, .rdiv | 나눗셈 |
| .floordiv, .rfloordiv | 소수점 내림 |
| .mul, .rmul | 곱셈 |
| .pow, .rpow | 제곱 |

In [223]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
                   columns=list('abcd'))
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
                   columns=list('abcde'))
df2.loc[1, 'b'] = np.nan

- 두 데이터 프레임을 더할시, 겹치지 않는 부분은 NA

In [224]:
df1.add(df2)

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

#### ```.add(fill_value = 0)``` : 겹치지 않는 부분을 NA가 아닌 더한 값으로

In [225]:
df1.add(df2, fill_value = 0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

### DataFrame과 Series간 연산

In [229]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                     columns = list('bde'),
                     index = ['Utah', 'Ohio', 'Texas', 'Oregon'])

In [232]:
series = frame.iloc[0]
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [233]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

- 인덱스 값을 데이터 프레임의 열이나 Series의 인덱스에서 찾을 수 없다면 reindex

In [237]:
series2 = pd.Series(range(3), index = ['b', 'e', 'f'])
frame - series2

          b   d     e   f
Utah    0.0 NaN   1.0 NaN
Ohio    3.0 NaN   4.0 NaN
Texas   6.0 NaN   7.0 NaN
Oregon  9.0 NaN  10.0 NaN

- 각 행에 대한 연산

In [238]:
series3 = frame['d']
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [239]:
frame.sub(series3, axis = 'index')

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

### 함수 적용과 매핑

### ```.apply(함수)``` : 함수 적용

In [246]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [247]:
f = lambda x: x.max() - x.min()

In [252]:
frame.apply(f, axis = 'index') # 각 행에 함수적용

b    1.447515
d    3.897048
e    2.590894
dtype: float64

In [251]:
frame.apply(f, axis = 'columns') # 각 열에 함수적용

Utah      2.929918
Ohio      0.337116
Texas     1.982115
Oregon    2.512506
dtype: float64

- 여러 값을 가진 Series를 반환

In [253]:
def f(x):
    return pd.Series([x.min(), x.max()], index = ['min', 'max'])

In [254]:
frame.apply(f)

            b         d         e
min -0.448567 -2.363500 -1.513557
max  0.998949  1.533548  1.077337

### ```.applymap(함수)``` : 포맷변환

In [258]:
format = lambda x: '%.2f' % x
frame.applymap(format)

            b      d      e
Utah     0.18  -2.36   0.57
Ohio     0.74   0.82   1.08
Texas   -0.45   1.53   0.14
Oregon   1.00  -0.74  -1.51

- 모든 Series는 각 원소에 적용할 함수를 지정하기 위한 map 메서드를 가지고 있음
### ```.map(함수)``` : Series에 함수 적용

In [260]:
frame['e']

Utah      0.566418
Ohio      1.077337
Texas     0.138347
Oregon   -1.513557
Name: e, dtype: float64

In [265]:
frame['e'].map(format)

Utah       0.57
Ohio       1.08
Texas      0.14
Oregon    -1.51
Name: e, dtype: object

### 정렬과 순위

### ```.sort_index(axis, ascending, by, method)``` : 정렬된 새로운 객체 반환
- ```axis``` : 정렬 방향
- ```ascending``` : False면 내림차순
- ```by``` : 정렬 기준을 삼을 열
- 결측치는 가장 마지막에 정렬
- 순위의 동률을 처리하는 method

| method | 설명 |
| -- | -- |
| 'average' | 기본값. 같은 값을 가지는 항목들의 평균값을 순위로 삼음 |
| 'min' | 같은 값을 가지는 그룹을 낮은 순위로 매김 |
| 'max' | 같은 값을 가지는 그룹을 높은 순위로 매김 |
| 'first' | 데이터 내의 위치에 따라 순위를 매김 |
| 'dense' | method = 'min'과 같지만 그룹 내에서 모두 같은 순위를 적용하지 않고 1씩 증가 |

In [266]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [279]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                     index = ['three', 'one'],
                     columns = ['d', 'a', 'b', 'c'])

In [278]:
frame.sort_index(axis = 'index')

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [280]:
frame.sort_index(axis = 'columns')

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

### 오름차순 / 내림차순
- ```ascending = False```면 내린참순

In [281]:
frame.sort_index(axis = 'columns', ascending = False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

### 정렬 기준 열

In [284]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame.sort_values(by = ['a', 'b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

### 중복 인덱스

In [285]:
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])

### ```is.unique``` : 해당 값이 유일한지 확인

In [286]:
obj.index.is_unique

False

In [288]:
obj['a']

a    0
a    1
dtype: int64

In [289]:
df = pd.DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])
df.loc['b']

          0         1         2
b  0.674132  0.503427 -0.017310
b  1.903736 -1.246102  1.699842

In [295]:
df.loc['b', 0]

b    0.674132
b    1.903736
Name: 0, dtype: float64